# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: 'Star Wars' }, { name: 'Lord of the Rings' }])
#   Character.create(name: 'Luke', movie: movies.first)

[
  ['いしかり湾漁協朝市', '1', 1], 
  ['館鼻岸壁朝市', '2', 2],
  ['神子田朝市', '3', 2],
  ['ゆりあげ港朝市', '4', 2],
  ['五城目朝市', '5', 2],
  ['秋田市民市場', '6', 2],
  ['小名浜魚市場' ,'7', 2],
  ['上越の朝市 一の日市' ,'8', 3],
  ['いくじ魚まつり 朝市', '9', 3],
  ['輪島朝市', '10', 3],
  ['勝浦の朝市' ,'11', 4],
  ['足立市場', '12', 4],
  ['三崎朝市', '13', 4],
  ['那珂湊おさかな市場','14', 4],
  ['下田 海の朝市' ,'15', 5],
  ['師崎漁港朝市','16', 5],
  ['鳥羽さかなセンター', '17', 5],
  ['市場の朝市（大津市公設地方卸売市場）', '18', 6],
  ['福良うずしお朝市', '19', 6],
  ['箕島漁港 とれピチ朝市', '20', 6],
  ['京橋朝市', '21', 7],
  ['因島市漁協鮮魚市', '22', 7],
  ['床波漁港朝市', '23', 7],
  ['JF北灘さかな市', '24', 8],
  ['活き活き日曜市', '25', 8],
  ['ひろめ市場', '26', 8],
  ['呼子の朝市', '27', 9],
  ['戸石フレッシュ朝市', '28', 9],
  ['水俣漁師市', '29', 9],
  ['深江の朝市', '30', 9],
  ['港あぶらつ朝市', '31', 9],
  ['あくね新鮮朝市', '32', 9],
  ['泊いゆまち', '33', 10]
].each do |name, prefecture,area|
  Market.create!(
    {name: name, prefecture_id: prefecture, area_id: area}
  )
end

[
  [1, '北海道地方'], [2, '東北地方'], [3, '北陸・甲信越地方'],
  [4, '関東地方'], [5, '東海地方'], [6, '近畿地方'],
  [7, '中国地方'], [8, '四国地方'], [9, '九州地方'],
  [10, '沖縄地方'],
].each do |id, name|
  Area.create!(
  {id: id, name: name}
 )
end

[
  [1, '北海道', 1],
  [2, '青森県', 2], 
  [3, '岩手県', 2],
  [4, '宮城県', 2], 
  [5, '秋田県', 2], 
  [6, '山形県', 2],
  [7, '福島県', 2], 
  [8, '新潟県', 3],
  [9, '富山県', 3],
  [10, '石川県', 3],
  [11, '千葉県', 4],
  [12, '東京都', 4],
  [13, '神奈川県', 4], 
  [14, '茨城県', 4], 
  [15, '静岡県', 5], 
  [16, '愛知県', 5], 
  [17, '三重県', 5], 
  [18, '滋賀県', 6 ],
  [19, '兵庫県', 6], 
  [20, '和歌山県', 6],
  [21, '岡山県', 7],
  [22, '広島県', 7],
  [23, '山口県', 7],
  [24, '徳島県', 8],
  [25, '香川県',8], 
  [26, '高知県', 8],
  [27, '佐賀県', 9],
  [28, '長崎県', 9],
  [29, '熊本県', 9],
  [30, '大分県', 9],
  [31, '宮崎県', 9],
  [32, '鹿児島県', 9],
  [33, '沖縄県', 10]
].each do |id, name, area|
  Prefecture.create!(
    {id: id, name: name, area_id: area}
  )
end